Setting_Terminal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-26 Mon 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="holy" />

     <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
     <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<div id="outline-container-orgd96088c" class="outline-2">
<h2 id="orgd96088c">Terminal &amp; shell settings</h2>
<div class="outline-text-2" id="text-orgd96088c">
<div class="note" id="org30b0097">
<p>
내가 원하는 terminal은 ls를 했을 때, 폴더와 파일을 구분해주기만 하면 된다.
icon으로 폴더를 보여주면 더 좋다.
</p>

<p>
내가 선택한 방식은 iterm2, zsh, colorls와 nerd font를 사용하기로 했다.
</p>

</div>
</div>
<div id="outline-container-org16caf3d" class="outline-3">
<h3 id="org16caf3d">Iterm vs Hyper</h3>
<div class="outline-text-3" id="text-org16caf3d">
<div class="note" id="org1b61ad1">
<p>
hyper보다는 iterm2가 인기도 많고 더 선호된다.
brew를 사용해서 iterm2를 설치하면 된다.
</p>

</div>
</div>
</div>
<div id="outline-container-org7e11093" class="outline-3">
<h3 id="org7e11093">zsh</h3>
<div class="outline-text-3" id="text-org7e11093">
<div class="note" id="org48bf546">
<p>
brew를 사용해서 zsh을 설치한다.
</p>

</div>
</div>
</div>
<div id="outline-container-org3126cc4" class="outline-3">
<h3 id="org3126cc4">colorls</h3>
<div class="outline-text-3" id="text-org3126cc4">
<div class="note" id="org7d235e1">
<p>
colorls는 다음 아래에 맞춰 설치하면 된다.
<a href="https://github.com/husnulhamidiah/colorls#custom-configurations">https://github.com/husnulhamidiah/colorls#custom-configurations</a>
</p>

</div>
</div>
</div>
<div id="outline-container-orge00ce4b" class="outline-3">
<h3 id="orge00ce4b">font</h3>
<div class="outline-text-3" id="text-orge00ce4b">
<div class="note" id="org32e1aa7">
<p>
폰트에서 이미지를 나타낼수 있는 font가 있다. ligarture라는 기능을 표시하는 폰트인데, 대표적으로
fira code font가 있다. 이런 기능을 가진 font들을 한데 모아놓은곳이 nerd font인데, colorls에서 사용하기
때문에 링크가 걸려있다. 참고로 아래에 link를 표시하면 다음과 같다.
</p>

<p>
<a href="https://github.com/ryanoasis/nerd-fonts/blob/master/readme.md">https://github.com/ryanoasis/nerd-fonts/blob/master/readme.md</a>
</p>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
